{
  "title": "Study Guide for RB139",
  "cells": [
    {
      "type": "markdown",
      "data": "please be comfortable with the following tuppics \n\n##Blocks\n[] Closures and scope\n[]- How blocks work, and when we want to use them.\n[]- Blocks and variable scope\n- Write methods that use blocks and procs\n- Methods with an explicit block parameter\n- Arguments and return values with blocks\n- When can you pass a block to a method\n- &:symbol\n\n##Testing with minitest \n- testing terminology\n- $std -in, StringIO\n- Minitest vs. RSpec\n- SEAT approach\n- Assertions \n\n## Core Tools/ Packaging Code\n\n- Purpose of core tools\n- Gemfiles\n\n## Regular Expressions\nRegular expersion aren't offically a part of this assesment nor are thy covered in detail in the course material.  You will find them useful though, when you work on the practice Coding Challenge problems.  Before you begin the practice challlenges, we recommned that you take some time to study our [introduction to regular expression](https://launchschool.com/books/regex) book\n\n## Precision of Language \n\nsome questions rquire that you explain code or concepts with words.  It's important to explain how code works using precise vocabulary and to pinpoint the causal mechanims at work.  In other words, us the right words and don't be vague.\n\nfor example let's take the following pieve of code\n\n```ruby\n\ndef a_method\n  puts \"hello world\"\nend\n```\n\nif we ask you to dscribe this cod youmay say \"the resul of the method is hellow world\"  This description isn't wrong but its impricess.  A more precise answer sayws \"the method outputs the string hello world, and returns nil.\"\n\n### The Coding Challenge\n\nthe final question of the assessment asks you to write a program that solves a coding challenge.  The program has about the same diffulty leve as the problems form the [challenges section of exercises](https://launchschool.com/exercises#challenges) and has the same Minitest-driven format\n\nto practice for the code cahllenge you shold do a least ten different problems from the Exercis  Challgnes, including at least three from the Medium section.  Be sure to mark which ones you completed.  Make sure you save you practice code on Github or somewher so we can look at it.\n\nTo beigin pracitiv,e visit the challenges section of the exercise page.  We rcommend taht you start with the easy challgnes before trying some of the harder ones.  Make sure you read the GGAQ first"
    }
  ]
}